{"10": "{\"passage\": \"You walk into the interior of the strange cavern;\\nthen wait while your eyes become accustomed to\\nthe dim, amber light. Gradually you can make out\\nthe two tunnels. One curves downward to the\\nright; the other leads upwards to the left.\\nIt occurs to you that the one leading down may\\ngo to the past and the one leading up may go to the\\nfuture\", \"actions\": [\"{\\\"text\\\": \\\"take the tunnel leading to the left\\\", \\\"to\\\": 20}\", \"{\\\"text\\\": \\\"take the tunnel leading to the right\\\", \\\"to\\\": 61}\", \"{\\\"text\\\": \\\"walk outside the cave again\\\", \\\"to\\\": 21}\"]}", "100": "{\"passage\": \"It's less than a mile to Parkersville, and the Pres-\\nident shakes your hand and wishes you luck. One\\nof the soldiers arranges with the station agent for a\\ncarriage to take you to a form owned by an old\\nfriend of his.\\nYou soon become a member of the family. They\\nare good people and make you feel very much at\\nhome. You are suprised to learn, however, that\\nthey plan to sell their farm and move to California.\\nThey new life in the West they describe is so appeal-\\ning that you decide to go with them.\\nYou never regret it, except, sometimes, you\\nwith you could see your own time again.\", \"actions\": []}", "101": "{\"passage\": \"With considerable trepidation you slide down\\nthe tunnel. You mean to turn off at one of the side\\npassageways that mighttake you back to yourown\\ntime, but you are too exhausted to search for the\\nentrance. You half slide, half climb down the\\ntunnel-further back into time-then you lose\\nyour balance. You fali a great distance, land in\\ndeep water, and sink a long ways.\\nYou are barely able to surface and, when you\\ndo, you find that the air is filled with dense fog. The\\nwater is warm, but the fog is so thick you can\\nhardly breathe. The air smells slightly of sulphur.\\nGasping for breath, yourealize you must be sev-\\neral billion years in the past and that oxygen has\\nnot yet been released into the atmosphere.\", \"actions\": []}", "102": "{\"passage\": \"You sit down and rest your chin in your hands,\\nunable to believe the fate that has befallen you. To\\nlive forever in a timeless world seems worse than\\ndeath.\\n\\\"Well, to tell the truth, there is a way to get back\\nto your own time,\\\" the woman finally says, \\\"but, if\\nyou follow it, you will not be able to live forever.\\\"\\n\\\"I don't care,\\\" you say. \\\"Show me the way.\\\"\\n\\\"Very well,\\\" she says, shaking her head in dis-\\nbelief. \\\"Dive under the rock ledge beneath me and\\nswim through the tunnel you will find there. You\\nwill come up in your own time. Don't worry, it's\\nonly a few yards. You can make it.\\\"\\nYou take a last look around, wave good-bye\\nand dive. A few seconds later you surface in a\\npond just inside the entrance of the Cave of Time.\\nYou s,r,,im to shore and run out through the cave\\nentrance into the open air, almost crashing into\\nyour Uncle Howard, who has come looking for\\nyou.\\n\\\"You're late for dinner,\\\" he says. \\\"We won-\\ndered what happened to you. You ought to keep\\n'better track of the time.\\\"\", \"actions\": []}", "103": "{\"passage\": \"The next day you call the Department of Zool-\\nogy at a nearby university, where you are refened\\nto Dr. Henry Kam, a specialist in large reptiles. Dr.\\nKam is skeptical about the egg but agrees to drive\\nto Red Creek Ranch immediately to see it.\\nBy the time he arrives, you are feeling very\\nnervous. Suppose the egg is just made of plastic?\\nYour concern is heightened by his stern appear-\\nance. He shakes hands brusquely with you and\\nyour uncle and immediately asks to see the egg.\\nWhen you hand it to him, he says nothing while\\nhe stares intenfly at it, holds it up to the lighf taps it\\nand scratches it with a pen knife. Then he holds it\\nto his ear.\\nFinally he smiles at you and genfly puts the egg\\ndown. \\\"lt's quite possible this is the egg of a\\nPlesiosaurus, an aquatic dinosaur of the late Juras-\\nsic period. It is highly unlikely it will ever hatch.\\nEven so, I would want to keep it in an incubator at\\nthe Universrty for at least a year before breaking it\\nopen. I'll . you know, of course, if anything develops.\\\"\\nA few weeks have passed since then and\\nwhenever the phone rings you wonder if Dr. Karn\\nis calling.\", \"actions\": []}", "104": "{\"passage\": \"When you tell him you come from the Twentieth\\nCentury through the Cave of Time, Nick smiles.\\nThen you tell him a little about life in your own\\ntime--about cars and planes, telephones and tele-\\nvision. He listens intently, with a big grin on his\\nface, as if you are telling the funniest story ever told.\\n\\\"I'm so glad to meet you,\\\" Nick says. \\\"I've\\nalways wanted to know about life in the Twentieth\\nCentury.\\\" He tries to look serious, but begins to\\nlaugh, thinking it's all a joke.\\n\\\"Seriously,\\\" you say,(since you know he will\\nnever believe you)\\\"I have no home.Do you know\\nof a place where I can stay?\\\"\\n\\\"l'm sure you can stay at our house,\\\" he says\\nwarmly. \\\"We have such a big family, one more\\nwon't matter, but you must be willing to work in\\nthe shop with the rest of us.\\\"\\nSince you feel you hardly have any other\\nchoice, you accept his offer and feel grateful when\\nhis parents give you a good dinner and a comfor-\\ntable bed. Nick tells you, with much seriousness,\\nthat you are living in the year 1718 in Boston, the\\nprincipal town in the British colony of Massachusetts.\\nYou soon become one of the family. They are\\ngood people and treat you well. But each day you\\nhave to work long hours boiling soap and pouring\\nit into molds, waiting on customers and doing\\nerrands for Nick's father, whom you have come to\\nknow as Uncle Ted.\\nYour neighbor, Mr. Nelson, is a printer. He rec-\\nently returned from England with a printing press\\nand letter type he bought there. The business in-\\nterests you, and you consider working as his ap-\\nprentice, but to do so you would have to sign\\npapers indenturing yourself to work faithfully for\\nhim for six full years.\", \"actions\": [\"{\\\"text\\\": \\\"decide to stay at home and continue to work for Uncle Ted\\\", \\\"to\\\": 107}\", \"{\\\"text\\\": \\\"decide to be indentured to be an apprentice in Mr. Nelson's printing business\\\", \\\"to\\\": 109}\"]}", "106": "{\"passage\": \"You do yourbestto make up a story about(ow\\nyou ran away from home, but Nick sees that you\\nare not telling him the tn:th. While you're talking,\\nhe packs up his fishing gear, says goodbye, and\\nwalks off.\\nOnce he is out of sight, you start down the road\\nand, after a mile or so, reach a setfled area. While\\nyou are standing near a church, wondering what to\\ndo next, a constable approaches and asks where\\nyou're from. This time you try to explain what\\nreally happned. After listening awhile, he arrests\\nyou for disorderly conduct and locks you up in the\\nlocal jail.\\nLater in the day, a big, stupidJooking guard\\ncomes to bring you a ration of soup and bread. He\\nis fascinated by your strange clothes and by the\\nrumors he has heard about you. After opening the\\ndoor to your cell, he hands you your food and\\nstands back and looks at you curiously.\\n\\\"They say you're in league with the devil,\\\" he\\nsays. \\\"ls it so?\\\"\", \"actions\": [\"{\\\"text\\\": \\\"try to run past the guard and escape\\\", \\\"to\\\": 111}\", \"{\\\"text\\\": \\\"tell him you are innocen\\\", \\\"to\\\": 113}\"]}", "107": "{\"passage\": \"Although you feel you would probably enjoy\\nthe printing business more than a career as a soap\\nmaker, you wish to remain free to take advantage\\nof some other oppurtunity.\\nThe work with Uncle Ted is tedious. You feel\\nyou could not bear life devoted to making candles\\nand soap. You spend most of your spare time\\nreading what books you can lay hold of, but you\\nare anxious to travel and see the world.\\nNot long afterwards, you sign up on the brigan-\\ntine, ina, as a deck hand. The ship is owned by a\\nrich merchant, and it is bound for Barbados in the\\nWest Indies with a load of lumber and then on to\\nEngland.\\nYou find life at sea much harder than you ex-\\npected, especially when you are required to climb\\nthe riggin in a howling gale, but eventually you\\nbecome captain of your own ship. In every place\\nyou visit you ask the people you meet wheter\\nthey have ever heard of the Cave of Time.\", \"actions\": []}", "109": "{\"passage\": \"You go to work in Mr. Nelson's shop and soon\\nbecome proficient in the art of printing. But after\\nawhile, you become increasingly unhappy. Mr.\\nNelson refuses to raise your wages or give you a\\nchance to own part of the business. There are no\\njobs available for you in Boston, so you decide to\\nmove to Philadelphia, where you have heard there\\nis a greater demand for printing.\\nHappily, Mr. Nelson agrees to release you from\\nyour indenture, and by selling almost all your pos-\\nsessions, you are able to raise enough money to\\nengage passage on a coastal schooner. After a long\\nand stormy voyage down the coast, your ship\\ndocks early on a Sunday morning at the Market\\nStreet wharf in Philadelphia.\\nYou are tired and hungry and you use some of\\nyour last money to buy a loaf of bread. Out of\\ncuriosity, you follow some well-dressed people\\ninto the Quaker meeting house. The people seat\\nthemselves, but, followingcustom, no one speaks.\\nIt is so peacefulyou fallsound asleep. When you\\nawaken, the Quakers welcome you. One family\\ngives you lodging and, fortunately, you are able to\\nget a job with one of the two printers in the town.\", \"actions\": []}", "11": "{\"passage\": \"\\\"Off to the tower,\\\" the Kingshouts. Two knights ;\\nleap forward, drag you out of the chamber, and,\\nwith spears at your back, force you to climb fonty\\neight stone steps to the tower prison-a tiny \\ncylindrical room with one small window looking out\\nover the moat and pasture Iand beyond. The only\\nfumiture is a bed of straw.\\nYou realize you are back in the early days of\\nfeudalEurope, where the only laws are the King's\\nwhims. You have no idea how long he intends to\\nkeep you in the tower. There is one possibility of\\nescape. The water in the moat, about twenty-five\\nfeet almost direcfly below your window, is quite\\ndeep. If youjump out far enough, you should land\\nin the deep water and not be hurt.\\n\", \"actions\": [\"{\\\"text\\\": \\\"jump\\\", \\\"to\\\": 12}\", \"{\\\"text\\\": \\\"do not\\\", \\\"to\\\": 13}\"]}", "110": "{\"passage\": \"You work hard to improve your skills as a\\nprinter. Within a few years, with the help of some\\nfriends, you are able to raise enough money to go\\ninto business on your own.\\nYour printing business thrives, and after awhile\\nyou start your own newspaper. It begins to look as\\nif the Eighteenth Century is a pretty good iime for\\nyou to be alive.\", \"actions\": []}", "111": "{\"passage\": \"The guard is too startled, and maybe even too\\nafraid, to stop you as you dart past him and out of\\nthe jail house. You run down the street as fast as\\nyou can. As you stop to catch your breaht, a thin,\\nbeared man driving a coach pulls up next to you.\\n\\\"You seem to be in some trouble.\\\" he calls out.\\n\\\"Can I be of help?\\\"\\nToo tired to make up any story, you begin to tell\\nhim everything that has happened to you. He is\\nvery excited by your story and invites you to a\\nnearby tavern, where you have your first good\\nmeal since you left Red Creek ranch. Your host\\nhardly eats anything. He looks pale and seems to\\nhave a bad cough.\\nWhen you finish recounting your tale, he says,\\n\\\"lt is strange that we have met. I have tuberculosis,\\nand no doctor in Boston can help me. My only\\nhope is to reach a future time.\\\"\\n\\\"l think it's my only hope too,\\\" you say.\\n\\\"lf we help each other, I think we can find our\\nway back to your time-my new tim e,\\\" he replies.\\nThe two of you shake hands on it and set out on\\nyour quest the next day at sunrise.\\nTogether, you are successful in finding your way\\nto the present time. Your friend from the past is\\ncured with the help of modem medicines and later\\nbecomes a history teacher who is known through-\\nout the countryr for his amazing knowledge of life in\\ncolonial America.\", \"actions\": []}", "113": "{\"passage\": \"When you tell the guard you are innocent, he\\nscowls and slams shut the door fo the cell.\\\" You'll\\nnot take me to the devil with you!\\\" he calls back\\nas he walks away.\\nThe next day you are brought into a courtroom\\nbefore a sten looking judge. After hearing the\\ncharges agaisnt you and listening to what you have\\nto say, he shakes his head and scowls angrily.\\nThen he looks at the prosecutor and pounds his fist\\non the bench.\\n\\\"Your charge against this person is for disor-\\nderly conduct, but the specifications you give are\\n'strange clothes and telling stories invented by the\\ndevil.' What you really are charging is witchcraft!\\nThere will be no such madness in my court and let\\nme have none of it again from you! Case dis-\\nmissed.\\\"\\nThe judge not only sets you free, but afterwards\\ngives you a home to live in and helps you on your\\nway to a good and happy life in the Eighteenth\\nCentury.\", \"actions\": []}", "114": "{\"passage\": \"There is a certian tone in the knight's laughter\\nthat does not inspire your trust, so you thank him\\ngraviously and tell him you have other business to\\nattend to.\\n\\\"Then go to it,\\\" the knight replies. \\\"Take care to\\nkeep your business drier than yourself!\\\"\\nHe gallops off in a rush. You are glad to be rid of him.\\nEager to find the entrance to the Cave of Time,\\nyou climb up behind the rock wall that slopes into\\nthe pond. After searching for an hour, you find a\\ntunnel leading underground.\", \"actions\": []}", "115": "{\"passage\": \"You jump aboard and find yourself in a sealed\\nchamber. The walls surrounding you remind you\\nof the inside of a bathtub. It occurs to you that the\\nbeings who control this spaceship have some\\nmeans of manipulating time. Could it be that the\\nCave of Time is their creation? fu you are thinking\\nthese thoughts, you become increasingly drowsy.\\nIn a moment you are asleep.\\nYou awaken in darkness, wondering if you may\\nbe traveling through space in the alien ship. There\\nis light coming toward you from one direction and\\nyou get up and walk toward it. Then gou realize\\nyou are looking through the opening of your cave.\\nYou hurry out and, to your joy, find Snake Can-\\nyon just as you remembered it. You are back in\\nyour own time.\\nIt's a long while before you feel like visiting\\nSnake Canyon again. When you do, youfind the\\nopening to the Cave of Time has been covered\\nover by a massive rock slide, and, you think to\\nyourself that may be just as well.\\n\", \"actions\": []}", "12": "{\"passage\": \"You jump far out and fall faster and faster. You\\nenter the water feet first and hit bottom, but the soft\\nmud receives you genfly. In a few seconds you\\nreach the surface. You swim to the outer banks of\\nthe moal shaken but unharmed. You scramble up\\nthe bank and run for the cover of the forest.\\nYou walk along the edge of the forest until well\\nout of sight of the castle, then head across the open\\ncountryrside. You stop a peasant to ask him where\\nyou might stay for the night.\\n.\\n\\\"Walk up that hill and you'll see before you the\\nwaters of Loch Ness, \\\" he says. \\\"You'll find a place\\nthere.\\\"\\nYou follow his directions and, seeing some little\\nhouses nearthe lake, proceed toward them. Dark-\\nness is seting in, and you are glad when you meet\\na fisherman who says he will give you shelter for\\nthe night. He and his wife are kindly people;\\nthey invite you to stay and earn your keep by helping\\nthem fish.\", \"actions\": [\"{\\\"text\\\": \\\"accept\\\", \\\"to\\\": 66}\", \"{\\\"text\\\": \\\"decide to travel on\\\", \\\"to\\\": 78}\"]}", "13": "{\"passage\": \"You decide to wait, but soon regret it. A guard\\nvisits you twice a day and brings you only black\\nbread and water. In a few days you feel almost too\\nweak to escape even if you have the chance.\\nBut just as you are beginning to despair of ever\\nregaining your freedom, the guard walks in, smiling.\\n\\\"The King has ordered you out of here,\\\" he\\nsays. \\\"We have a much more important\\nprisoner-a man who insulted the King's horse.\\\"\\nHe laughs in your face. You don't know whether\\nhe is telling the truth or not, but he holds the door\\nand waves you out. You walk down the long flight\\nof stone steps to the main courtyard, free againat least for the moment. The drawbridge is down\\nand there seems to be nothing in the way of your\\nleaving the castle.\\nThere is a splendid black horse tied up near you,\\nprobably owned by one of the knights. It occurs to\\nyou that you could cover a lot of ground on that\\nhorse before anyone realizes what happened.\", \"actions\": [\"{\\\"text\\\": \\\"mount the horse and ride off\\\", \\\"to\\\": 14}\", \"{\\\"text\\\": \\\"ask the King for refuge\\\", \\\"to\\\": 15}\"]}", "14": "{\"passage\": \"In a moment you are across the bridge and\\ngalloping over the countryside, feeling a good deal\\nsmarter than the King and his knights. When you\\npass some shepherds and wave, they wave back.\\nYou stop to rest at the cottage of a friendly\\ngoatherd, who feeds you a good dinner. \\\"Do not\\nfear the King,\\\" he says. \\\"He is a fool who sits and\\ndrinks grog all day. His only concem is deciding\\nwho to put in the tower. His own knights laugh at\\nhim, and he is more likely to fall from his throne\\nthan you from your horse. Be off now and on to\\nMenie England, for great things await you there.\\nGod speed and good fortune!\\\"\\nYour energies are renewed by good food and\\ndrink, and your horse too is ready to ride. You\\nthank your hostwarmly and ride off to new adven-\\ntures and a new life---almost a thousand years\\nbefore you are bom.\\n\", \"actions\": []}", "15": "{\"passage\": \"You gain enhance to the King and thank him for\\nletting you out of the tower.\\n\\\"Think nothing of it,\\\" the King replies. \\\"We\\nwould do as much for any villain. We like your\\nspirit and, though your story makes as much sense\\nas a dancing mule, it brought laughter to our eyes.\\nYou have, without meaning it we are sure, performed a service for your King. We thank you.\\n\\\"We'll see that you have a horse and some\\npieces of gold,\\\" the King continues. \\\"Go and\\nmake your fortune. We command you thoughcome once a ye:rr and tell us a story no less amusing than what we have heard from your lips.\\\"\\n\\\"My lord,\\\" you say.\\n\\\"My excellent vassal,\\\" he replies.\\nYou ride off, somewhat apprehensive, but in-\\ntent upon making as much of your life as is possible\\nin the year 982.\", \"actions\": []}", "16": "{\"passage\": \" You resolutely trudge along a rocky ridge. It has\\nbeen cleared of whirling snow by the fierce wind,\\nwhich bites and blows against your body.\\nThe world seems hansformed, and much for the\\nworse. You must find a house or a cabin-people\\nwho can help you----or you will die.\\nfu you ponder your fate, you stumble and fall,\\nplunging into a deep crevasse. You black out and\\nlater awaken, still shivering, but in a warmer place\\nat least. By the dim amber light, you can see that\\nsomehow you have fallen back into one of the\\nchambers in the Cave of Time. A passageway\\nleads to the right, another to the left. Does one lead\\nto the future and one to the past?\\n\", \"actions\": [\"{\\\"text\\\": \\\"enter the left-hand passageway\\\", \\\"to\\\": 24}\", \"{\\\"text\\\": \\\"enter the right-hand passageway\\\", \\\"to\\\": 25}\"]}", "17": "{\"passage\": \"As you enter the cave, you see a flickering light\\nahead and you smell smoke. You make your way\\nalong a winding passageway and enter a large\\nchamber. Fires rise out of earthen vessels.\\nSeveral short, stocky people with straight black\\nhair and primitive faces are painting pictures on the\\nwalls of the cave. They are dressed in animal skins.\\nIn a corner of the cave ate beds of straw.\\nYou stand, slighfly afraid, as the cave people\\ndrop their work and run over and stare at you in\\ndisbelief. The largest man is camTing a long vine.\\nHe steps forward as though he might seize you and\\ntie you up.\", \"actions\": [\"{\\\"text\\\": \\\"stay and try to make friends\\\", \\\"to\\\": 26}\", \"{\\\"text\\\": \\\"try to run for it\\\", \\\"to\\\": 28}\"]}", "18": "{\"passage\": \"You continue on, following a trail leading up a\\nsteep incline. You hear loud, bumpeting sounds\\nfrom a nearby ravine-the sounds of a large ani-\\nmal.You climb over some rocks and find vourself\\nlooking down on one of the largest land mammals\\nthat ever lived-the wooly mammoth. Huge as\\nthis creature is, its dize is exaggerated even more by\\nits thick coat of wool.\\nYou are cold, desperate, and tired. From your\\nrock ledge, only a few feetoverthe mammoth, you\\ncould drop down on its back, burrow into its warn\\nwool, and ride where it takes you!\", \"actions\": [\"{\\\"text\\\": \\\"jump down on the wooly mammoth\\\", \\\"to\\\": 29}\", \"{\\\"text\\\": \\\"continue on foot\\\", \\\"to\\\": 30}\"]}", "2": "{\"passage\": \"You've hiked through Snake Canyon once before while visiting your Uncle Howard at Red Creek Ranch, but you never noticd any cave entrance. It looks as though a recent rock slide has uncovered it.\\nThough the late afternoon sun is striking the opening of the cave, the interioir remains in total darkness. You step inside a few feet, trying to get an idea of how bit it is. As your eyes become used to the dark, you see what looks like a tunner ahead, dimly lit by some kind of phosphorescent material on its walls. The tunnel walls are smooth, as if they were shaped by running water. After twenty feet or so, the tunnel cuves. You wonder where it leads, You venture in a bit further, but you feel nervous being alone in such a strange place. You turn and hurry out.\\nA thunderstorm may be coming, judging by how dark it looks outside. Suddenly you realize the sun has long since set, and the landscape is lit only by the pale light of the full moon. You must have fallen asleep and woken up hours later. But then you remember something even more strange. Just last evening, the moon was only a slim crescent in the sky. You wonder how long you've been in the cave. You are not hungry. You don't feel you have been sleeping. You wonder whether to try to walk back home by moonlight or whether to wait for dawn, rather than risk losing your footing on the steep and rocky trail\\n\", \"actions\": [\"{\\\"text\\\": \\\"decide to start back home\\\", \\\"to\\\": 4}\", \"{\\\"text\\\": \\\"decide to wait\\\", \\\"to\\\": 5}\"]}", "20": "{\"passage\": \"The tunnelto the left winds around like a spiral,\\npassing several more funnels. You tum down one\\nof them, then climb steeply. In a few moments you\\nclimb through a hole and emerge in a desert. The\\nweather is extremely hot----certainly over 100 de-\\ngrees, but the sun is just about to set, so it should\\nbe getting cooler. In the distance is a range of\\nmountains. which look extremely high, yet are\\nbare of snow. You have no idea whether you are in\\nthe past, the future, or the present. Then you see\\nsomething that fascinates and disturbs you. The\\nsand seems to be fused into yellowish glass as if\\nheated in a furnace. As you examine the sand\\nmore closely, you feelthe air getiing even hotter.\\nSuddenly you realize the sun is not setting, but\\nrisingl The noontime temperafure must be more\\nthan life can stand. As the sun rises higher, you feel\\na blistering wave of heat. The light is almost blind-\\ning. Could it be that you are witnessing the end of\\nthe world?\\nYou turn and walk back out of the cave. It\\nshould be dawn by now, but, as you grope your\\nway toward the entrance, you can't see any light\\ncoming into the cave. You press against the walls,\\nfeeling for an opening. Your hands pass across\\nsomething cold, wet, and hard. Ice! The entance\\nis sealed by it. Blocks of ice protrude into the cave.\\nYou step back, feeling confused and helpless.\\nYou wish ilwerejust a dream. You retrace your\\nsteps a way, trying to think clearly. You know that\\nyour only chance to get out of the cave is to follow\\none of the two branches before you.\", \"actions\": [\"{\\\"text\\\": \\\"\\\", \\\"to\\\": 93}\"]}", "22": "{\"passage\": \"The laughing knight helps you up on his horse\\nand you sit uncomfortably as it canters over the\\ncountryside. After traveling a mile or so, you come\\nto a great, stone castle. The horse trots across the\\ndrawbridge and into the stable.\\n\\\"Jump,\\\" the knight calls to you, and you slide\\noff the rear of the horse. The knight escorts you\\ninto the grand chamber of the castle. All about you\\nare stewards, attendants, and knights. A few min-\\nutes later you find yourself bowing before the King\\nhimself.\\nAfter hearing your story, the King looks gravely\\nat his advisors and knights and stewards. \\\"Does\\nanyone believe this tale?\\\" he asks.\\nEveryone cries back, \\\"No, Your Majesty,\\\" or\\n\\\"Certainly not, Your Majesty.\\\"\\n\\\"Then tell us the truth!\\\" the King roars at you.\", \"actions\": [\"{\\\"text\\\": \\\"insist you are telling the trush\\\", \\\"to\\\": 36}\", \"{\\\"text\\\": \\\"try to make up a plausible story\\\", \\\"to\\\": 37}\"]}", "24": "{\"passage\": \"You follow the left passageway. It leads upward\\nto the surface. Before you, a grassy meadow\\nslopes down to a clear, fast-flowing stream; be-\\nyond it are pine-covered foothills stretching in the\\ndistance toward snow-covered peaks. You might \\nbe in Wyoming in your own time, but, whatever\\ntime it is, the world you see appears to be a hospi-\\ntable one.\\nYou notice a herd of buffalo grazing. But\\nnowhere can you see a house, or fence, or road, or\\nany sign of human presence. It is possible you are\\nliving hunders, perhaps thousands, of years ago.\\nYou gaze upward. One of the puffy, white\\ncumulus clouds is moving in a strange fahsion. It is\\ndescending! A spaceship is landing right before\\nyour eyes, only a few hundred yards away!\\n\", \"actions\": [\"{\\\"text\\\": \\\"hide from view\\\", \\\"to\\\": 38}\", \"{\\\"text\\\": \\\"go up to the spaceship\\\", \\\"to\\\": 40}\"]}", "25": "{\"passage\": \"You walk along the right-hand passageway for a\\nlong clisiance, praying that you can find a iunnei\\nthat wiil lead to your own time. You choose one ai\\nthe n:any tunnels you see and follow it. Instead oi\\nrising to the surface, you enter a brightly-lightecl\\nchamber, in the center of which is a bearded, oiC\\nman seateci in a chair.\\n\\\"Welcorne,\\\" he says, as if he has been expecting you.\\n\\\"Thank you,\\\" you reply. \\\"Can you help me fir:C\\nmy way back to my own time?\\\"\\nThe old man srniles. \\\"First of all,\\\" he says, \\\"tell\\nme why you want to return to your own time\\ninstead of another time.\\\"\\n\", \"actions\": [\"{\\\"text\\\": \\\"say, \\\\\\\"Because I want to be back with my family and friends,\\\\\\\"\\\", \\\"to\\\": 43}\", \"{\\\"text\\\": \\\"say, \\\\\\\"Because I don't want to take a chance of being in a bad time,\\\\\\\"\\\", \\\"to\\\": 41}\", \"{\\\"text\\\": \\\"say, \\\\\\\"I would like to try  another time, but only if you can assume me that I will eventually get back to my own time,\\\\\\\"\\\", \\\"to\\\": 44}\", \"{\\\"text\\\": \\\"say, \\\\\\\"Who are you?\\\\\\\"\\\", \\\"to\\\": 45}\"]}", "26": "{\"passage\": \"You make friendly gestures. The man holding\\nthe vine steps back and smiles. The people talk to\\nyou in a friendly fashion, but you cannot under-\\nstand what they are saying, nor can they under-\\nstand you. You feel awkward, but happy to be safe\\nand warm for the moment.\\nSeveral people have gone back to working on\\ntheir paintings. You decide to try communicating\\nthrough drawing. You begin to draw a picture of\\nyourself eating. The care people laugh, but one of\\nthem brings you a slive of half-cooked meat. It\\ncioesn't taste very good, but you are so hungry l,,cu\\ndon't mind\\nGrarlually you make friends and iearn a. ie'-,.,\\ni..,ords. Some of the people go hunting anrl coine\\nback with garne. Others make clothing from ani-\\nmaiskins. You help with cleaning and cooking and\\neach day paint a picture on the walls\\\" The others\\nare {ascinated by your drawings of airplanes. ships.\\nand cars-things they see only as abstract ciesigns.\\nfor they have no way of knowing whai function\\nthey could serve.\\nOne day a group of other people visit. You have\\nnever seen them before, bui your frienris welcome\\nthem wa.rmly, holding a great feast in their honor.\\nAfter everyone is through eating, the conversa-tiorr\\nintensifies. You can tell that the cave people are\\ntaiking about a serious problerrr. Then, one by\\none, they drift off to sleep. You walk outside to see\\nif you can learn anything. The ground is covered\\nwith deep snow. A bitter cold wind blows the snovr\\nin whirling clouds.\\nNext morning, the people pack up their belong-\\nings and they urge you to do so also. Some migration is obviously intended-no doubt to a warmer\\nclimate. You feel you should go with the cave\\npeople, but you have a great longing to return to\\nyour own home, and your only hope of doing so is\\nto find your way back to the Cave of Time.\\n\", \"actions\": [\"{\\\"text\\\": \\\"go with the cave people\\\", \\\"to\\\": 46}\", \"{\\\"text\\\": \\\"try to find your way back to the Cave of Time\\\", \\\"to\\\": 47}\"]}", "28": "{\"passage\": \"You can see no future for yourself .with these\\nprimitive peopie, so yorl run back towarci the Cave\\nof Time. Fortunately, they do not follow you, and\\nyou are able to find your way.\\nBy the time you re-enter the cave, you are hun-\\ngry and exhausted. The light is dimmer than be-\\nfore and you grope your way along, looking for a\\npassageway. You stumble and fall headfirst down\\nagreeably. You look up and see daylight ahead. A\\nminute later, you walk out of the cave into warm,\\nmoist air near a foest of leafy trees. A bird flies by.\\nYou don't know when it is, but it looks pleasant enough\\nAs you iand, ihe mammoth shudders lihe a\\nhorse shaking otf flies. It begins iumbering along\\nup the valley, apparently unaware you are stiil\\nclinging to its wooly back, keeping warm and enjoying the ride.\\nThe marnmoth reaches high ground, nibbles at\\nsorne bark, and then walks on. Perhaps it willcarry\\nyou near sorne cave men who will give you food\\nand shelter.\\nSuddeniy the mammoth stops and turns its\\nhead-listening for something. You look up and\\nsee human figures approaching frorn two sides.\\nThey are carrying spears and clubs. The mam-\\nmoth begins to run. You hold on tight. The hunters\\nfollow-screaming and yelling. You can't see\\nwhere the mammoth is heading, but you're afraid\\nthe hunters may drive it off a cliff. Yet, if you jump\\noff while it's running, you could be badly hurt.\", \"actions\": [\"{\\\"text\\\": \\\"\\\", \\\"to\\\": 51}\"]}", "30": "{\"passage\": \"Ridingon a mammoth mightbe fun if you were\\nnot cold and hungry and lost, but where would it\\ntake you? You continue walking, your spirits sink-\\ning. Just as you feelready to sit down and cry, you\\nsee an opening in the ground. You crawl in on\\nyour hands and knees. It might provide some\\nwarmth, and it might lead to the Cave of Time.\\nYou find yourself in a tunnel. There are other\\ntunnels branching off. You feel sure now you are in\\nthe Cave of Time. You are eager to take the next\\ntunnel to the surface, but you want to tavel a long\\nway fonvard in time. Maybe you should tdke a\\ntunnel further on.\", \"actions\": [\"{\\\"text\\\": \\\"take the first tunnel that you can\\\", \\\"to\\\": 54}\", \"{\\\"text\\\": \\\"take a tunnel further on\\\", \\\"to\\\": 92}\"]}", "31": "{\"passage\": \"You take the first tunnel and follow it on and on\\nuntil you begin to wonder whether you are going\\naround in circles. What can this mean? Perhaps\\ntime itself is slowing. You are nearing the point of\\nexhaustion, and begin to feelvery cold. You see an\\nopening up ahead and stars shining. You step\\noutside on barren ground. It is bitler cold. Even\\nthough there is no wind, you know you will freeze\\nif you stay more than a few minutes-maybe not\\nthat long, for the air seems very thin, as if you were\\non top of a very high mountain. You find yourself\\ngasping for breath. You look up at the clear, cold\\nnight sky studded with thousands of stars. Among\\nthe stars, you notice a disk the size of the sun that\\ngives off a dim red light like a dying ember.\", \"actions\": []}", "32": "{\"passage\": \"After following the passageway for a consider-\\nable distance, you enter a very large tunnel that\\nseems as likely as anyto leadyou backto yourown\\ntime. You continue along and soon notice that the\\nfloor of the funnel is becoming sandier. Perhaps\\nyou are coming to a beach. Then the sand gives\\nway under your feet; you slide through sand and\\nrising dust. You cannot stop yourself--it is too\\nsteep; then there is nothing under your feet, and a\\nmoment later you land in deep water. You swim to\\nthe surface and catch your breath. You are in an\\nunderwater giotto, which seems completely\\nsealed off except for a portion of its roof that is\\nopen to the blue sky. You swim to a large, smooth\\nrock sloping into the water.\\nThe sand is white, and the water transparenL\\nThe rocks are made of crystalline material of the\\nmost delicate shades of blue. For a moment you\\nare overwhelmed by the beauty of the scene be-\\nfore you can escape from it. There is no way of climbing\\nout through the opening in the roof.\\nYou dive down in hopes of finding an underwa-\\nter passageway that might lead to freedom, and\\nyou find one! But could you swim through it before\\nrunning out of air?\", \"actions\": [\"{\\\"text\\\": \\\"try to swim through the underwater tunnel\\\", \\\"to\\\": 58}\", \"{\\\"text\\\": \\\"decide to wait\\\", \\\"to\\\": 64}\"]}", "34": "{\"passage\": \"You make your way along in the dim light.\\nAhead of you is a ladder. You take hold of it and\\nbegin to climb. Suddenly you hear a tenible grind-\\ning, crunching noise. The ladder shudders. You\\nhold on tight for a few minutes after the noise\\nsubsides. Then you continue up the ladder and a\\nmoment later pull yourself out into the crisp, cold\\nnight air. Lights are glowing all around you. In\\nfront of you is a large slab of ice. You feel a strange\\nmotion as if the ground is moving. When you\\ntouch the ground with your hand, you feel wood.\\nNot far from you is a railing. Beyond it-the sea!\\nAbove you are stars more numerous and brilliant\\nthan you have seen before. You realize you are on\\nthe deck of a very large ship.\\nNot far from you, hanging on a hook, is an\\nenorrnous life preserver. Stenciled on it in black\\nletters is the word TITANIC. You know there was\\nonly one ship that ever bore that name, that it\\nmade only one voyage, that it struck a huge\\niceberg, and that three hours later it was resting on\\nthe bottom of the Atlantic.\\nfu you walk along the deck of the Titanic, you\\nrealize that below the water line thousands of gal-\\nlons of water per minute are pouring into the for-\\nward compartment.The people don't seem to\\nrealize what's happening. The sea is a as calm as\\nglass. The band on the deck below you is playing a\\nwaltz. Several men in long black coats and women\\nin fur jackets are walking close by.\\n\\\"Goodness,\\\" one woman says, \\\"I can't under-\\nstand why the captiain has stopped the ship. If we\\nare late docking in New York, I'm going to lodge a\\ncomplaint with the owners.\\\"\", \"actions\": []}", "35": "{\"passage\": \"You walk along the left-hand passageway, pass-\\ningtunnels from time to time, none of which looks\\nlike a particularly appealing route. You decide to\\nsee if you can reach the end of the passageway.\\nYou walk on and on, hour after hour. Then, in\\nthe distance, you see a figure approaching--a girl\\nwearing blue jeans and a red sweater and carrying\\na backpac-k. She tells you that her name is Louisa\\nand that she was exploring a cave and got lost. She\\ndoes not know she is in the Cave of Time.\", \"actions\": [\"{\\\"text\\\": \\\"try to help Louisa find the way back to where she entered the cave\\\", \\\"to\\\": 76}\", \"{\\\"text\\\": \\\"suggest she try one of the tunne;s with you as a way out\\\", \\\"to\\\": 80}\"]}", "36": "{\"passage\": \"\\\"l know it sounds stange, Your Majesty,\\\" you\\nsay, \\\"but I have no reason to incur your wrath by\\nmaking up a false story.\\\"\\nThe King looks around at his courtiers. They all\\nlrave grave expressions on their faces, as if you\\nhave committed some unpardonable sin.\\n\", \"actions\": [\"{\\\"text\\\": \\\"\\\", \\\"to\\\": 11}\"]}", "37": "{\"passage\": \"\\\"I'm sorry to have intruded upon your royal\\ndomain, Your Majesty.\\\" you say humbly, tying to\\nthink up a good story as fast as you can. \\\"It is tue,\\nsire,,l have been badly mistreated by .ny wicked\\nstepfather, with whom I live, and I place myself\\nunder your wise and just protection.\\\"\\n\\\"Who is this wicked stepfather and where does\\nhe live?\\\" the King asks. \\\"lf he is wicked enough,\\nwe may want him to be one of our knights,\\\" he\\nadds, laughing, as do all the courtiers.\\n\\\"He lives beyond that hill,\\\" you say, pointing\\ntoward a high wooded ridge, \\\"and his name is\\nSmith.\\\"\\nThe King laughs once again. \\\"Then your step\\nfather must be a fish,\\\" he says, \\\"for beyond yon-\\nder hill is Loch Ness.\\\"\\n\", \"actions\": [\"{\\\"text\\\": \\\"\\\", \\\"to\\\": 11}\"]}", "38": "{\"passage\": \"Y_ou fegl you must be far in the future. Are you\\nreally.looking at an alien spaceship? If so, you\\nwould rather watch from a safe distance. you\\nclimb rapidly up the hill-wondering how you got\\nto this shange time.\\nel,\\\"q4 of you is a niche in the rocks. you step\\ninside. You realize you are in the bottom of the\\ncrevasse you fell into from the Ice Age. Even if you\\nwanted to get back to that time, there is no way\\nyou could do so. You keep walking. Eventually\\nyour approach open ground on the opposite side\\nof the hill.\\nNow you can see a vast stretch of open\\ncountry-hilly, rocky, and mostly barren. Yet\\nthousands of people are constructing a huge wall!\\nAll over the landscape you see oxen pulling carts\\nfilled with rocks. The wall is at least twenty feet high\\nand extends as far as the eye can see.\\nLadders are strung up agaisnt the wall, and on\\nevery rung a man or woman is stationed. They\\nhand rocks up one to another to the top of the wall.\\nYou find this sight hardly less amazing than the\\nsight of the alien spaceship, for it appears that you\\nare witnessing the building of the Great Wall of\\nChina.\\n\", \"actions\": [\"{\\\"text\\\": \\\"go up the wall builders\\\", \\\"to\\\": 82}\", \"{\\\"text\\\": \\\"return to the crevasse\\\", \\\"to\\\": 87}\"]}", "4": "{\"passage\": \"As you start walking back toward the ranch, you\\nnotice the trail seems very diflerent than you remember it, though of course moonlight can play\\ntricks on your eyes. But you suddenly realize you\\nare not walking on the hail at all, but on what\\ns\\u00e2\\u201a\\u00acems to be a dried-up river bed. You hurry back\\nto the cave entrance. You look around vou and\\nrealize the whole landscape has changei. Wtit\\\"\\nyou were in the cave, torrents of water have\\nwashed out the trail; yet there is not so much as a\\npuddle left. You shiver. It is cold, much colder than\\nit should be at this time of year. You take a jacket\\nout of your backpack and put it on, but you are still\\nfreezing.\\nfu least the world about you seems brighter. It's\\ngfiing lid,t in tre easL The sun will soon be up.\\n\\\\-otr bok at your watch. ft has run down, though\\npu -,ror-nrd il ordy a fan hours ago. Nothing seems\\nm rnake -nse anyrpre.\\nyou lcul pu should set bdk to the ranch as\\nquiJdy as posribb, yet somehow you feel the only\\nuag b cltange trings back to the way they were is b re<nter the catue.\\n\", \"actions\": [\"{\\\"text\\\": \\\"continue toward the ranch\\\", \\\"to\\\": 8}\", \"{\\\"text\\\": \\\"go back into the cave\\\", \\\"to\\\": 10}\"]}", "40": "{\"passage\": \"You cautiously approach the spaceship and, to\\nyour amazement, see that it is resting a foot or so\\nabove the ground, without any visible mechanism\\nkeeping it aloft. There are no engines, rocket\\nexhausts, port holes, landing gear, antennae, or\\nany equipment you might imagine a spaceship\\nwould need. You realize it must be the product of a\\nsupremely advanced civilization.\\nTrusting that such people have Ieamed to be\\nloving toward others, you approach the ship. A\\nportal slides open, but all you can see within is\\nshimmering blue light. A large cube is thrust out\\nthrough the portal and lowered to the ground by\\nmechanical arms. The top of the cube is with-\\ndrawn, leaving a pallet on which lie the sleeping\\nforms of three men and three women, dressed in\\nshrouds of animal skin. Their bodies and features\\nremind you of pictures you have seen depicting\\nthe earliest men on earth. You have an impulse to\\njump aboard the spaceship before the portal\\ncloses.\\n\", \"actions\": [\"{\\\"text\\\": \\\"do\\\", \\\"to\\\": 115}\", \"{\\\"text\\\": \\\"do not\\\", \\\"to\\\": 83}\"]}", "41": "{\"passage\": \"\\\"l can understand,\\\" the old man replies, \\\"why\\nyou don't want to take a chance with another time,\\nfor other times are perilous and filled with evil\\npeople and evil deeds.\\n\\\"You are wise to avoid them, and I willgladly\\ndirect you back to your own time, which, you\\nshould know, is no better and no worse.\\\"\", \"actions\": []}", "43": "{\"passage\": \"\\\"And why do you want to be back with your\\nfamily and friends?\\\" the old man asks.\\n\\\"Because I will miss them and could hardly bear\\nnot to see them again. And my family and friends\\nwould be sad not to see me.\\\"\\n\\\"You think of others, and you think of yourself\\ntoo,\\\" he replies. \\\"That is a good reason to be in\\nyour own time. Take the next tunnel to your right,\\nand you will find yourwaythere. You have chosen\\nto have only one time, have you not?\\\"\\n\\\"That is true,\\\" you reply.\\n\\\"Then make the most of it,\\\" he says, with one\\nhand outstretched to wish you well.\\n\", \"actions\": []}", "44": "{\"passage\": \"\\\"Ah, you are a shrewd one,\\\" the old man says.\\n\\\"You'll try to get two loaves of bread, rather than\\nsettle for one. Well, I'll show you one other time,\\nand, if you don't like it, just say so, and I'll retum\\nyou to your own time, if there is time to do so. Take\\nthe tunnel to your left.\\\"\\nYou follow his direction, walk through the tun-\\nnel, and come out onto a bity street\\\" Instantly you\\nrealize there is a war going on. Bombs and rockets\\nare exploding all around you. You cry out to the\\nold man, asking to be retumed to the Cave of\\nTime, but there is no time left.\\n\", \"actions\": []}", "45": "{\"passage\": \"\\\"l am a philosopher,\\\" the old man says, \\\"who,\\nwhen asked to choose a time, insiead chose\\ntimelessness, so that, although nothing would ever\\nhappen in my life, I would have all the time in the\\nworld to think about it.\\\"\\n\\\"Are you happy with your decision?\\\"\\n\\\"No, because philosophy is nothing outside of\\ntime. Take the tunnel to your right. Return to your\\nown time, and let your life be your philosophy.\\\"\\n\", \"actions\": []}", "46": "{\"passage\": \"Dressed as warmly as possible in your crude\\nboots and coat of animal skins, you leave shortly\\nafter sunup with the others, a ragged band of thirty\\nmen, women, and children. Luckily th'ere are no\\nbabies; they could never survive the migration.\\nThe sun shows briefly through the clouds, the wind\\nabates, and you make good progress on your\\nsouthward jotrmey.\\nAfter only a few days of travel, everyone is\\nnearing exhaustion. The hunters have not been\\nable to find enough game. There is no way to light\\na fire at night and the only way to keep from\\nfreenng is to sleep huddled together.\\nAfter a week though, you notice the sun shines\\nmore warrnly at midday and the snow is not quite\\nso deep.'It begins to look as though you will sur-\\nvive, though you must give up hope of ever return-\\ning to your own time.\\n\", \"actions\": []}", "48": "{\"passage\": \"You pack up your few belongings. The one you\\nprize most is a knife carved from the tusk of a\\nwooly mammoth. You wave goodbye to your\\nfriends and trudge through the snow, trying to\\nrehace your steps back to the Cave of Time.\\nThough the wind is colder than ever, the bright sun\\nstirs your hopes.\\nYou have become much more rugged from liv-\\ning with the cave people, and your crude animal-\\nskin clothes keep you surprisingly warm. You find\\nyour way down into the canyon and in a few hours\\nreach the entrace to the cave, now almost cov-\\nered with blowing snow.\\nYou are exhausted from the long trek, and your\\neyes are watering from the cold wind. You hardly\\nnotice the large, gray shape only a few yards from\\nthe entrance to the cave until you hear the deep,\\nguttural grown of a wolf. Now you stare directly into\\nits cold, cruel eyes. You feel that at your slightest\\nmovement it will spring at you. You must think\\nwhat to do before you move. You probably could \\noutrun the wolf to the cave. It might hesitate before\\nfollowing you- and give you enough time to\\nescape-or you could try to knife the wolf in the\\nthroat as it leaps at you.\", \"actions\": []}", "49": "{\"passage\": \"Slowly you unsheath your knife and then run for\\nthe entrance. The wolf is after you like a shot. It\\nleaps and tears your bearskin coat. While the wolf\\nis regaining its balance, you run into the cave and\\ntoward the left tunnel. The wolf runs after you.\\nYou look over your shoulder and lose your foot-\\ning. Instead of falling on the ground, you feel\\nyourself sliding down a long, steep chute. Far\\nabove, the wolf howls with frustation. You land in\\na heap at the bottom of a pit-shaken but un-\\nharmed. There is a dark passageway to the left.\\nYou toss in a stone and, after what seems like a long\\ntime, you hear a splash far below. Fortunately,\\nthere is another passageway to the right, which is\\ndimly lit by phosphorescent light.\\n\", \"actions\": [\"{\\\"text\\\": \\\"\\\", \\\"to\\\": 25}\"]}", "5": "{\"passage\": \"You wait until moming, but, as the rosy wisps of\\ndawn begin to light the eastem sky, a chill and\\nforbidding wind begins to blow.\", \"actions\": [\"{\\\"text\\\": \\\"seek shelter\\\", \\\"to\\\": 6}\", \"{\\\"text\\\": \\\"brave the freezing wind to see more of the world about you\\\", \\\"to\\\": 16}\"]}", "50": "{\"passage\": \"Holding your knife with its long ivory blade\\npointing upward, you advance very slowly, step by\\nstep, toward the wolf, which stands growling softly,\\napparently confused by your boldness.\\nThen it springs. You lunge with your knife, twist-\\ning your body to avoid its awesome fangs. Your\\nknife cuts through nothing but air, but the wolf\\nsucceeds only in tearing off your bearskin coat. It\\nstops for an instant to sniff at the coat, and you tum\\nand plunge your knife into its neck. The wolf twists,\\nlooks at you with hate in its eyes, and falls limp, its\\nspinal cord severed.\\nNow you are a true Stone Age hunter. You skin\\nthe wolf and walk into the cave.\\nYou follow the righlhand tunnel, thinking you\\nmay find your way back to your own time, but\\nsuddenly you feel yourself falling-faster and fast-\\ner into what seems a bottomless pit.\", \"actions\": [\"{\\\"text\\\": \\\"\\\", \\\"to\\\": 81}\"]}", "51": "{\"passage\": \"Suddenly you hear voices shouting. You hide in\\na thicket. An animal crashes through the brush. In\\na moment some men rush by in pursuit, camTing\\nspears and slings. You imagine thatyou must be in\\nan era long before the advent of civilization. You\\nfollow an animal tail; it soon leads to a clearing,\\nand you lie down in the grass to rest. Looking up in\\nthe sky, you see a long, thin, white steak. You rub\\nyour eyes and look again. It seems to be a vapor\\ntail from a jet plane! You may be lMng in the\\npresent time after all.\\nAfter several days of wandering through the\\njungle, you reach a settlement on the banks of a\\nlarge river. There is an airfield nearby, and within a\\nfew weeks you are able to obtain a ride back to\\ncMlization and retum to your family-just a month\\nafter you first entered the Cave of Time. You are\\nhappy to be back home, but shocked at how much\\nolder everyone looks. And they express the\\ngreatest surprise that after eleven years you\\nhaven't changed a bit!\\n\", \"actions\": []}", "52": "{\"passage\": \"You work your way back to the mammoth's\\nrump and slide down, landing hard on the icy\\nground, where you lie aching and bruised, while\\nthe mammoth lumbers on. Suddenly it disap-\\nears, driven off the cliff. The hunters are shouting\\nand cheering. Some of them come up to you.\\nThey are short and muscular, their jaws jut out,\\nand they have bright squinting eyes. Their black\\nhair hands down to their shoulderss. They are\\ndressed in animal skins.\\nYou look up helplessly, wondering what they\\nwill do to you, but in an instant you can see they\\nwill not hurt you. They help you up and carry you\\nback to their cave and feed you steaming broth. It\\ntates awful, but makes you feel much better. You\\nsoon learn that the cave people will accept you as\\none of them, because you have-without realizing\\nit-performed the sacred rite of their culture by\\nriding bravely on the back of a mammoth.\\nLife is hard and simple with the cave people,\\n and sometimes you long for your family, your\\nfriends, and your own time again; yet your new life\\nis as exciting and happy as you could wish for.\", \"actions\": []}", "53": "{\"passage\": \"You hold tightly to tufts of wool, hoping the\\nmammoth will slow down enough so you can\\nsafely slide off. But suddenly it pitches forward,\\nmaking a terrible bellowing. In an instant you\\nrealize you are falling through space. You cry out\\nhelplessly as you lose your grip, falling faster and\\nhster.\\nThousands of years later when Dr. Carleton\\nFrisbee, the famous paleontologist, finds your\\nbones next to those of a wooly mammoth in the\\nRed Creek excavation, he is amazed at how\\nclosely you resemble a twentieth-century human\\nbeing.\\n\", \"actions\": []}", "54": "{\"passage\": \"You enter the next tunnel you come to. It be-\\ncomes smaller and smaller until you must crawl.\\nYou continue this way for almost an hour. Finally.\\nyour faith is justified, for you smell a frsh breeze\\nblowing across a filed of new-mown hay.\\nA moment later you are blinking your eyes in the\\nbright sunlight, looking at a beautiful meadow nes-\\ntled between gentle hills. A dozen or more cows\\nare grazing near a meandering stream. In the dis-\\ntance is a dirt road. A farmer is sitting on a cart filled\\nwith hay. A dapple-gray horse is pulling the cart\\ntoward a big red barn in the distance. From the\\nother direction you hear the mournful hooting of a\\ntrain whistle.\\nYou turn around and see that you are only a few\\nhundred feet from the railroad tracks. A train is\\nchugging around the bend, puffs of black smoke\\nrising from its coal-fired steam engine. You are out\\nof the Ice Age, all right, but not exactly in your own\\ntime.\\nThe train slows down as it approaches you ani\\nyou smile as you see the reason why-a cow b\\nstanding on the hacks just ahead, looking as if it\\nwould not move for anything. The train pulls to a\\nstop, and a man jumps down from the cab, waving\\na coal shovel at the cow, which waits almost until\\nthe man is upon her before stroiling back into the\\npasture. At that moment you realize you could\\neasily climb onto the back of the train.\", \"actions\": [\"{\\\"text\\\": \\\"climb on the train\\\", \\\"to\\\": 94}\", \"{\\\"text\\\": \\\"go to the farm\\\", \\\"to\\\": 98}\", \"{\\\"text\\\": \\\"go back into the tunnel in hopes of finding your way back to your own time\\\", \\\"to\\\": 101}\"]}", "56": "{\"passage\": \"Through computer instruction you are able to\\nlearn the language, which you find is similar to\\nEnglish, so you are soon able to communicate with\\nyour hosts.\\nThey are not at all surprised to hear that you\\narrived through the Cave of Time.\\n\\\"You are not the first,\\\" the head of the house-\\nhold tells you. \\\"but we have visitors form other\\ntimes only once in a great while. When someone\\ncomes, we are always glad to learn about life in\\nanother era, because here we have achieved a sort\\nof paradise--we do not work, and the worls is at\\npeace. It is a perfect society. That is why primitive\\nepochs, such as yours, interest us so much.\\\"\", \"actions\": [\"{\\\"text\\\": \\\"stay in \\\\\\\"the perfect society\\\\\\\"\\\", \\\"to\\\": 57}\", \"{\\\"text\\\": \\\"try to return to the Cave of Time\\\", \\\"to\\\": 60}\"]}", "57": "{\"passage\": \"Your hosts give you a fine bedroom with large\\nwindows overlooking the park on one side. On\\nanother wall is a beautiful painting of the Califomia\\nseacoast. When you push a button, the painting\\nfolds up to the ceiling, revealing a large screen.\\nYour room contains a computer terminal that en-\\nables you to select any movie or other program\\nyou desire from over 10,000 possibilities. There\\nare even films where you are the main character\\nand you can make choices as to what will happen\\nnext in the story. Then, if you don't like the way the\\nplot is working out, you can go back to an earlier\\npoint and make different choices from then on.\\nOn your terminal you can also play games and\\nflash pages of books or magazines on the screen.\\nYou can live quite well without even getting out of\\nbed.\\nEventually you go exploring. You meet other\\npeople, but you find none of them very interesting,\\nso you spend most of your time watching the\\ngreatest movies of all time. Gradually you settle\\ninto your new life. One thing disturbs you. No one\\nhas made any new movies in the last 300 years.\\n\", \"actions\": []}", "58": "{\"passage\": \"You take a deep breath, dive down, and swim\\nthrough the tunnel. There is light ahead. In a mo-\\nment you surface in a beautiful lagoon. Thatched\\ncottages are nestled among the palm ilees that rim\\nthe white sand beach. A warrn, softbreeze brings\\nthe scent of jasmine and the sound of stuange\\nmelodies from sonorous drums. Looking out to\\nthe inlet from the sea, you can see a fleet of outrig\\nger skiffs with multi-colored sails running into the\\nlagoons before the wind, their owners leaning\\nagainst the booms to hold the sails out.\\nYou walk toward the village. Several hand-\\nsome, brown-skinned people see you. Some of\\nthem run away, but others walk toward you with\\nhands held up in salute. Two children, holding\\ngarlands of flowers, mn up to you. Someone\\ncalls-\\\"Aloha!\\\"\\nSoon you are sffing in frontof a huge beach fire,\\ncooking crabs and eating buana cake. Having\\nnever had a visitor before, your hosts are happy to\\nsee you. They welcome you into their society.\\nGradually you leam their language. Jhe boys tell\\nyou they are your brothers; the girls that they are\\nyour sisters.\\nYou enjoy life in this new paradise, but you still\\nwonder whether there might be a way to get back\\nto the Cave of Time. Your new friends are unable\\nto help. Perhaps if you joumeyed inland you could\\nfind some who could. Your friends wam you\\nagainst trying, however. They tell you that you will\\nfind only tenible jungles and rivers filled with\\ncrocodiles.\\n\", \"actions\": [\"{\\\"text\\\": \\\"remain with your new friends\\\", \\\"to\\\": 62}\", \"{\\\"text\\\": \\\"journey inland\\\", \\\"to\\\": 63}\"]}", "6": "{\"passage\": \"You step into a niche in the rocks to escape the\\nmerciless blast of wind and lean back against the\\nrock wall. Suddenly it crumbles under your\\nweight, causing you to fall backward down a\\nmuddy slope and into a pond.\\nThe sun shines brighfly down on you as you pick\\nyourself up, dripping wet, and wade to the grassy\\nshore. You look back at the rock, rising out of the\\npond, but you can't see where you fell through.\\nWhile you are collecting your senses, a horse\\ncomes prancing up, its rider dressed in tin\\narmor-a knight out of the history booksenough to make you laugh. The horseman lifts off\\nhis helmet and laughs himself.\\n\\\"What a place for a bath!\\\" he calls out. \\\"Well, it\\nwas worth it-you're cleaner than a pig!\\\" He almost falls off his horse, he is laughing so hard. \\\"But\\nclimb on and I'll take you back to the casfle,\\\" he\\nsays. \\\"We'll see if we can't make a human out of\\nyou yet.\\\"\\n\", \"actions\": [\"{\\\"text\\\": \\\"accept the ride back to the castle\\\", \\\"to\\\": 22}\", \"{\\\"text\\\": \\\"decline the invitation and try to find your way back into the Cave of Time\\\", \\\"to\\\": 114}\"]}", "60": "{\"passage\": \"There is something deadening about the perfect\\nfuture society that makes you want to retum to\\nyour own time as quickly as possible. With a brief\\nword of farewell, you humT back to the tunnei,\\nclimb down, and find a fork to the right that you\\nhope will take you toward the right time. Soon you\\nare climbing up toward the surface, excited about\\nthe discovery you are about to make.\\nWhen you reach the surface, it is completely\\ndark. A chill wind is blowing. You sit resolutely\\nwaiting for dawn so that you can see what kind of a\\nworld you are in. Meanwhile, there is no way of\\ntelling what time it is, either by your watch or by the\\nstars.\\nYou hear loud, clicking sounds all around you,\\nmostly in the distance, but some quite close. As the\\norange-pink glow of oncoming dawn lightens the\\neastem sky, you see nearby the shape of a creature\\nthat is the size of a sheep but has a very different\\nappearance.\\nYou follow the tunnel downward a short dis-\\ntance, suddenly you are sliding. Your head stikes\\nsomething and you are knocked unconscious.\\nWhen you wake up, you find yourself by a small\\nlake, bordered by woods. A boy about twelve\\nyears old is fishing nearby, but there is no one else\\nin sight. You go up and intuoduce yourself, hoping\\nyou can find out what year it is without sounding\\ncraa).\\nFortunately, the boy is friendly and good na-\\ntured. He tells you his name is Nick Tyler and that\\nhe lives on Birch Steet He works in his father's\\nbusiness making candles and soapthe best in the\\nColonies, he says.\", \"actions\": []}", "62": "{\"passage\": \"Your friends are understanding about your wish\\nto lind the way back to your own time, but th ey tell\\nyou they can show you something you never\\ndreamed of. Since their society is very primitive,\\nyou wonder what they could have in mind.\\nNext day they lead you to another cove where\\nthe waves rollin, rise up against the cliff and then\\nroll out again. Sometimes the waves clap against\\neach other and send a foamy spray of water high in\\nthe air. You see some young people on tiny\\nrafts-nothing more than surfboards-riding in on\\nthe crests of the waves and then riding them out on\\nthe rebound. In a few hours you have leamed a\\nsport that brings excitement and fascination for\\nhour after hour.\\nWith such delights as this, it is not long before\\nyou lose interest in retuming to your own time.\\nSometimes you wonder, but you never leam,\\nwhether this paradise lies in the future or the past.\", \"actions\": []}", "63": "{\"passage\": \"You hug your friends good-bye and climb the\\nridge bordering the jungle. You soon find an ani-\\nmal hail leading through the dense undergrowth\\ninto a tropical rain forest. The green canopy of\\ntreetops is far overhead and only an occasional\\ndapple of sunlight reaches the spongy, dark\\nground. You walk on and on, hoping to reach the\\nmountains, where you might find another en-\\ntrance to the Cave of Time.\\nNight falls and you make yourself a crude bed.\\nYour mattress is the mossy floor of the forest. You\\nspread out fem leaves for a sheet. Early the next\\nmoming, as the birds are beginning their moming\\nsongs, you are awakened by the boa constrictor\\nwrapped around your neck.\\n\", \"actions\": []}", "64": "{\"passage\": \"Swimming through the underwater tunnel may\\nbe the only way to get out of the grotto, butthe risk\\nof drowning seems too great. You explore the\\nrocks in the grotto and think about how you might\\npossibly get up through the roof.\\nSuddenly a voice calls, \\\"Hello.\\\" You whirl\\naround and notice forthe firsttime, huddled in ihe\\ncomer, a woman with sparkling blue eyes and a\\nmysterious smile. She is sitting crosslegged,\\npropped against a rock which is shaped in a way\\nthat gives her a comfortable seat. In her hands she\\nis holding a flute, and as you stare in amazement\\nshe plays an unfamiliar melody with a sweetness\\nand purity of tone such as you have never heard.\\n\\\"Hello,\\\" you reply. \\\"Tell me-who are you and\\nhow can we get out of here?\\\"\\n\\\"Sit down,\\\" she says, \\\"and relax. You have all\\nthe time in the world.\\\"\\n'1What do you mean?\\\" you reply. \\\"l am\\ntuapped. I slid down from the Cave of Time and I\\nwant to get out.\\\"\\n\\\"Believe me, \\\" the woman says, \\\"there's no way\\nto get out; but do not be concemed. It is a beautiful\\nplace and you can be very happy here.\\\"\\n\\\"But we'll starve. How long have you been\\nhere?\\\" you exclaim.\\n\\\"Forever and not at all,\\\" she replies, \\\"for this is\\nthe part of the cave which leads neither to the past\\nnor to the future. Here, time does not eist, so, of\\ncourse, you will never be hungry or bored, and,\\nalthough you can never get out, you will behere\\nfor no time at all.\\\"\\n\", \"actions\": [\"{\\\"text\\\": \\\"\\\", \\\"to\\\": 102}\"]}", "66": "{\"passage\": \"You accept the offer, for you can hardly expect a\\nbetter life at this point, and soon you begin to enjoy\\nrowing out in the early morning mists and spread-\\ning your nets with the neighbouring fishermen.\\nOne afternoon, as the people are pulling up\\ntheir boats for the night, your friend, Angus\\nMcPhee, raises a cry and points at the water. You\\nlook out and see the great head and neck of a sea\\nmonster-a htige dragon of the lake. Nearby,\\nsplinters of wood are floating in the water.\\n\\\"That was Sutherland's boat,\\\" Angus cries out.\\n\\\"lt's been a hundred years since the monster has\\nbeen seen, but now it has retumed!\\\"\\nThe monster swims away and soon is lost from\\nview in the mists.\\n\\\"How could the monster be gone for a hundred\\nyears and then return?\\\" you ask Angus. \\n\\\"Somewhere near Beatty's Point,\\\" he replies,\\n\\\"there is an cave where the monster\\nstays as long as it pleases-because it is a Cave of\\nTime.\\\"\\nlf only you could find your way back to the Cave\\nof Time! But chances seem slim, and the risks\\nseem great.\", \"actions\": [\"{\\\"text\\\": \\\"try\\\", \\\"to\\\": 70}\", \"{\\\"text\\\": \\\"do not try\\\", \\\"to\\\": 74}\"]}", "68": "{\"passage\": \"Could you change history and save hundreds of\\nlives by waming the captain that the \\\"unsinkable\\\"\\nTitanic is destined for the bottom of the Aflantic?\\nYou see some stairs leading to a higher deck, and\\nyou run up them.\\nA steward is standing near the top. \\\"You can't\\ncome up here,\\\" he cries. But you dart past him and\\nrun toward the forward part of the ship. You dash\\nup another set of stairs, where you find yourself at\\nthe starboard wing of the bridge. The gray-\\nbearded captain is standing only a few feet away,\\nlooking out to sea through his binoculars at a ship\\non the horizon.\\n\\\"Captain,\\\" you call out. \\\"You may not realize it,\\nbut this ship will sink in only two or three hours.\\\"\\nHe tums and looks atyou gravely. \\\"l know,\\\" he\\nsays softly. \\\"But we are going to fire dishess rock-\\nets. That ship out there-the Calit'omian--+hould\\nrespond to help us.\\\"\\n''They will not respond, Captain,\\\" you tell him.\\n\\\"They can'tbelieve the Tifonic could be in touble,\\neven though they see your rockets. Your only\\nhope is to put your strongest men in a lifeboat and\\nhave them row toward the Calilomion at top\\nspeed-firing rockets as they approach.\\\"\\n\\\"Great heavens, you have bold ideas,\\\" the cap-\\ntain replies, \\\"but I need every man I have to lower\\nour lifeboats and keep order among the passen-\\ngers. I can't believe theCalilomion will not come\\nwhen they see our rockets.\\n\\\"Now go to the deck below. Mr. Lightoller will\\nsee that you have a place in a lifeboat.\\\"\\nWith that the captain turns and stuides away,\\ngiving orders to an officer nearby. You sadly retum\\ndown the stairs and wait in line for one of the\\nplaces in a lifeboat.\\nTwo hours later, you sit huddled in the crowded\\nboat, shivering in the coldbreeze, and watch the\\ngreatTitanic slip beneath the waves-with 1,500\\npeople still aboard-together with your only hope\\nof finding your way back to the Cave of Time.\", \"actions\": []}", "70": "{\"passage\": \"One day when the sun is bright and the water as\\nwarm as it's likely to get, you take an old skiff and\\nrow to Beatty's Point. You pull your boat up on the\\nrocky shoal that marks the cave. You dive again\\nand again along the rock wall that drops into the\\ndepths until you find the entrance. You swim a few\\nfeet inside and find you can get up to the surface\\ninside an enormous cavern, most of it filled by an\\nunderground lake.\\nYou reach the shore and walk along the\\nlakeside, deeper and deeper into the cavern,\\nwhich is lit by a mysterious blue light. Then, ahead,\\nyou see what you had hoped to find__a tunnel thal\\nsurely must lead to the Cave of Time. Nearby in\\nthe sand are three eggs as large as footballs. You\\npick one up and carry it into the tunnel. After\\nwalking awhile, the air becomes hard to breathe.\\nYou begin to feel dizzy and fall unconscious to the\\nground, still clutchinng the enormous egg.\\nYou are awakened by a fresh breeze blowing\\ntoward you. You dizzrly get to your feet, pick up\\nthe egg, and humy toward the fresh air----outdoors\\nagain in Snake Canyon! Everything is as you re-\\nmember it and in a few hours you are walking up to\\nthe ranch, where your uncle says he is surprised\\nyou got back so quickly!\\nWhen you tell what has happened to you, no\\none at the ranch believes it, though they are fasci-\\nnated by your enorrnous egg.\\n\\\"Maybe we'll believe that egg is real-and be-\\nlieve your story-if it will hatch a monster,\\\" your\\nuncle says, \\\"or if you break it open to show us\\nwhat's inside.\\\"\\n\", \"actions\": [\"{\\\"text\\\": \\\"decide to break the egg open\\\", \\\"to\\\": 72}\", \"{\\\"text\\\": \\\"keep it in your closet until you have a chance to get scientific advice\\\", \\\"to\\\": 103}\"]}", "72": "{\"passage\": \"With your aunt and uncle and some ranch\\nhands standing by, you very gently tap the egg\\nwith an axe, hoping it will Split open without fragmenting.\\n\\\"Wait a minute!\\\" Uncle Howard cries out. \\\"l'm\\nready to believe you, but I think we better get a\\nnaturalist down from the University to see this\\nfirst.\\\"\\nYou are relieved that your uncle feels this way,\\nbecause it seems like a tenible responsibility--\\ncracking open an egg like that and possibly killing a\\nrare monster before it is bom.\\nUncle Howard calls the nafuralist, a famous pro-\\nfessor of paleontology, who agrees to come down\\nthe following Saturday. You place the egg in a\\nlarge bowl in the middle of the dining room table.\\nThe neg day is Friday, and that evening the\\nwhole family goes out to the movies. When you\\nretum, you find the house has been broken into\\nand the egg is missing,\\nNeitheryou, yourauntand uncle, noranyof the\\nranch hands, nor the police are ever able to find\\nthe egg. Most people you tell your story to just\\nsmile and say, \\\"Sure.\\\" But Uncle Howard, even\\nthough he is a skeptical man, tells you he knows\\nyou were telling the truth.\", \"actions\": []}", "74": "{\"passage\": \"The idea that the Loch Ness monster goes into\\nthe Cave of Time for a hundred years or so before\\nretuming seems preposterous. And, even if it does,\\nit seems very doubtful you could dive down deep\\nenough to find the underwater entrance. So you\\nresign yourself to making a living fishing the waters\\nof Loch Ness.\\nYou find it a tolerable, though not very interest-\\ning, life. You particularly like rowing out in your\\nskiff in the early moming mists and watching the\\npale, red sun struggling io shine through thehaze.\\nThat'swhatyouare doingone day when youfeela\\ntremendous thump under your boat, the stem is\\nheaved high into the air, and you are hurled over\\nthe bow and into the jaws of the monster.\\nSome of your friends find the wreckage of your\\nboat later in the day and, throughout the village,\\npeople say to each other-\\\"The monster has re-\\ntumed again.\\\"\", \"actions\": []}", "76": "{\"passage\": \"After hearing of the forbidding world you've\\nwitnessed atyour end of the Cave of Time, Louisa\\nis agreeable to your helping her ty to find the way\\nback to her entance.\\n\\\"Tell me about the world outside your entrance\\nto the Cave of Time. Is it in America? What year is it\\nthere?\\\" you ask, as the two of you walk along.\\n\\\"The year 2022, of course,\\\" she replies.\\n\\\"You mean people are still wearing blue jeans\\nthen?\\\" you ask.\\n\\\"They've come back into style lately,\\\" she\\nlaughs.\\n\\\"You must have some new inventions that we\\ndid not have in my time. Tell me aboutyour most\\nmodern things.\\\"\\n\\\"l think the best things are the bicycle trails.\\nSince 1997 they've allowed no new roads to be\\nbuilt--<nly bike trials---and now there are as many\\nmiles of bike trails as there are of roads for cars.\\n\\\"So you can really bike all over the countr5r?\\\"\\nyou ask.\\n\\\"Sure-and not alongside buses and trucks and\\ncrazrT drivers, but through forests and across plains\\nand deserts and along rivers and steams. I some-\\ntimes feel like biking lorcver that way, and there\\nare hostels for bikers where you can sleep in com-\\nfort for almost nothing. Most of the cost is paid for\\nby taxes on gasoline.\\\"\\nSuddenly you feel the ground gving way be-\\nneath your feet. You and Louisa are falling. The\\ntwo of you land at the base of a steep bluff, shaken\\nbut unharmed, alongside a road. You wonder\\nwhat year you have anived in. Then, nearby, you\\nsee a billboard thatsays, \\\"CADILLAC-the Carof\\nthe Year, every Yearl\\\"\\n\\\"What's a Cadillac?\\\" Louisa asks.\", \"actions\": []}", "78": "{\"passage\": \"You'd rather spend the rest of your life search-\\ning for an enfuance to the Cave of Time than settle\\nfor the placid life of a fishing village. So you bid\\nyour new friends farewell and set out over the\\ncountryside, headed south for London. Your goal\\nis to find a ship to take you to America, though you\\nknow America hasn't been discovered yet, for\\nsomehow you must find your way back to Red\\nCreek Canyon and the Cave of Time.\\nA few hours later, as you are walking on a road\\nalong the edge of the forest, some burly men ride\\nout from behind a clump of trees.\\n\\\"We've got you,\\\" one shouts. \\\"You're the one\\nwho escaped from the tower, aren't you?\\\" They\\nforce you upon a horse and ride at top speed\\ntoward the casfle.\\n\\\"The penalty for escaping from the tower is\\nhanging,\\\" one of them tells you.\\nYou find out he is right.\\n\", \"actions\": []}", "79": "{\"passage\": \"You have no wish to risk sinking with the fd@rt\\nso you climb back down the ladder into the hold of\\nthe shiphoping that somehow you will find grorr\\nway back to the cave. In your haste, you lose your\\ngripand fall. You reach out, but too late. You land\\nso hard you are knocked out. When you awaken,\\nyou are in one of the passageways of the cave.\", \"actions\": [\"{\\\"text\\\": \\\"explore the passageway\\\", \\\"to\\\": 86}\", \"{\\\"text\\\": \\\"decide to check out the outer entrance to the cave again\\\", \\\"to\\\": 88}\"]}", "8": "{\"passage\": \"As it gets lighter, you realize you can't be on the right track. The canyon seems shallower than it was. The river bed is strewn with boulders that were never there before. The cold wind chills you to the bone; yet it's the middle of summer. As you climb to higher ground to get a better view, you notice patches of snow. From the top of a ridge you survey a barren plain, frozen lakes, and, in the distance, a massive range of snow-covered mountains. You begin to realize you are not merely lost-you are lost in time, and you have somehow been transported to an Ice Age that occured many thousands of years ago.\\nYou walk toward one of the cliffs that borders the canyon, seeking shelter from the wind, and notice an entrance to another cave. You are tempted to go inside, but you feel you should keep moving in hopes of somehow reaching familiar country.\\n\", \"actions\": [\"{\\\"text\\\": \\\"enter the cave\\\", \\\"to\\\": 17}\", \"{\\\"text\\\": \\\"continue on\\\", \\\"to\\\": 18}\"]}", "80": "{\"passage\": \"\\\"Since you can't find your way to your own\\ntime,\\\" you say, \\\"perhaps we can find my time.\\\"\\nYou lead her back a short distance, until you\\ncome to an unusually wide tunnel. You stop, and\\nLouisa looks at you inquiringly. \\\"Let's try this\\none,\\\" you say.\\nAfter haveling almost an hour, the two of you\\nsmile with joy to see light ahead, and you soon\\ncome out of the tunnel and stand on reddish\\nsandy ground, surveying a saucer-shaped terrain.\\nThe air is as fresh and clear as on a crisp, fall day.\\nYou guess that you may be in the crater of an\\nextinct volcano. Suddenly, there is a thundering\\nroar behind you. Louisa and you run from a\\nlandslide that buries the tunnel leading back to\\nthe Cave of Time.\\n\\\"l wonder what year it is?\\\" Louisa asks, after\\nthe two of you have collected your wits.\\nFor the first time you look up at the sun. It is\\nfour times as large as the sun you knew, though\\nnot as bright. It is almost direcfly overhead, yet its\\ncolor is a rusty red.\\n\\\"l don't know the answer,\\\" you'reply, \\\"but\\nfrom what I've read about astronomy, I would\\nguess it's the year 2,000-plus about four billion\\nyears.\\\"\\n\", \"actions\": []}", "81": "{\"passage\": \"You feel yourself slowly regaining conscious-\\nness. You are in your bed at Red Creek Ranch,\\nlooking up at Uncle Howard. Standing nearby is a\\nfriend of his who is a doctor.\\n\\\"You took quite a bad fall climbing on those\\nrocks up in the canyon,\\\" Uncle Howard says.\\n\\\"Doc Parsons tells me he doesn't know why you\\ndidn't break any bones. We were real worried\\nabout you-thought you got lost in one of those\\ncaves up there.\\\"\\nYou feel abit dizzl and weak, so you just smile\\nand say nothing. Probably no one would believe\\nyou anyway. Years later, though, you write a book\\nabout your adventures in the Cave of Time.\\n\", \"actions\": []}", "82": "{\"passage\": \"You go up to the base of the wall where the\\npeople are working. When they see you, they\\nimagine you are a spy from some unknown tribe.\\nSome guards capture you and force you to sit on a\\npile of rocks while they talk about you.\\nAfter a while they point to one of the ladders.\\nTwo other people force you to start handing up\\nrocks. You realize that you have been conscripted\\nto work building a wall twenty feet high, twelve feet\\nwide, and 1,400 miles long. You calculate it will\\ntake about ten billion rocks to build the wall. You\\nwonder how many of them you will lift before you\\ncan escape-if you ever do.\", \"actions\": []}", "83": "{\"passage\": \"Much as you would like to see the inside of rhe\\nalien ship, you have no desire to be whisked off\\ninto space. You step back to what you hope is a\\nsafe distance and watch what happens. In a mo-\\nment the portal closes, and almost instantly the\\nship rises, silenfly, siraight up. Within a few min-\\nutes it is lost from view. You walk over to look\\nmore closely at the primitive looking people sleep-\\ning on the pallet. They begin to stir and stretch and\\nrub their eyes as if waking frorn a long sleep.\", \"actions\": [\"{\\\"text\\\": \\\"stay and try to make friends with the primitive people\\\", \\\"to\\\": 85}\", \"{\\\"text\\\": \\\"return to the hill and try to find your way back to the Cave of Time\\\", \\\"to\\\": 84}\"]}", "84": "{\"passage\": \"You run upthe hill and outof sightbefore any of\\nthe primitive people awaken. You must find an\\nentance to the Cave of Time. You search in the\\nhigh rocky ground for some opening. Hours go by;\\ndusk is fast approaching. Just as you are about to\\nglve up hope, you spy the entrance to a cave under\\na rock ledge. You eagerly step inside and have\\nonly a momenf s awareness that it is the den of a\\nsaber-toothed tiger.\", \"actions\": []}", "85": "{\"passage\": \"The people look around curiously. They hardly\\nseem to notice your presence. One by one they get\\nup and walk around. One of them drinks from the\\nstream. They make grunting and clicking noises,\\nbut do not seem to be actually talking among\\nthemselves. The largest of the group picks up a\\nstick from the ground and begins prying up the\\nroots of plants along the edge of the stream. He\\nbites at each one..Finally he smiles and passes the\\nroot around to the others. One woman claps her\\nhands. The others begin to find sticks. One of the\\nmen hands you a piece of root. You bite at it. It\\ntastes like a di4y carrot. The women smile at you.\\nYou are accepted in the group.\\nThe next moming you wake up in the soft mossy\\nbank in Snake Cavem, a few dozen yards from the\\nentrance to the cave, wondering how much of\\nwhat has been happening to you has been a\\ndream and how much has been reality. But you\\nhave no desire to go into the Cave of Time again.\", \"actions\": []}", "86": "{\"passage\": \"You walk on and on, hoping the passageway\\nwill lead you to your own time. You soon come to\\na tunnel that leads into a dark, musty room re-\\nsemblingthe cellar of a large house. There are a\\ngreat many people huddled in groups, sitting on\\nblanke_ts in complete darkness save for the light of\\na few flickering candles. You hear the dismal wail\\nof a siren. Near the center of the room an old-\\nfashioned radio sits on the table playing a mixture\\nof classical music and static. Then the -rens stop,\\nthe ground shakes, and you hear a tremendous\\nexplosion nearby, then another further away, then\\nanother so close that a wall and half the ceiling\\nc.ome crashing down in a piie of rubble, blockin[\\nthe tunnel. You and the others scramble to the\\nopposite side of the room, coughing and gasping\\nin the dust-filled air.\\nYou are about to begin a new life. The year is\\nl94O; the place, London.\", \"actions\": []}", "87": "{\"passage\": \"You have no desire to be involved in building\\nthe Great Wall of China, or, for that matter, to be\\ntaken to another planet by aliens. You walk back\\ninto the crevasse, hoping io find a tunnel that\\nmight lead to another time. You walk along ihe\\nbottom of the crevasse and reach an opening on\\nthe other side of the ridge, where you half expect\\nto see the rolling countryside, the stream and the\\nspace ship that were there before.\\nInstead, the crevasse leads to the ocean! Like a\\nbad dream, where the scene suddenly changes\\ninto something entirely different, you find that the\\nhills have become waves, which stlrround you so\\nthat the rock you are standing on is only a reef\\nprotruding a few yards above the wind-swept seas.\\nAnd there seems to be no escape, because, for all\\nyou can tell, you are standing on the only land in\\nthe world\\\"\\n\", \"actions\": []}", "88": "{\"passage\": \"You walk back through the cavem, wondering if\\nthe entrance will still be blocked by ice. This time,\\nthough, you are greeted by a warm breeze. Sun-\\nlight is shining on the ground near the entrance,\\nand you walk outside.\\nSquinting your eyes in the bright light, you see a\\nworld totally different from the one you know. You\\nare on a hillside. For miles and miles you can see\\ngrassy plains speckled with lakes. Nearby is a forest\\nof towering fems, swaying in the wind. The world\\nbefore you seems strangely quiet, except for the\\nfaint rumbling of distant thunder. Suddenly, the\\nthunder seems much closer-and louder. The\\nthundering sound is moving through the fems.\\nYou run up the hill looking for a place to hide. A\\nhuge shadow passes on the ground. Above you,\\nsoaring through the air, is a creature larger than\\nany bird you have seen.\\nNow it is clear what has been happening. The\\ncave is a crack in the universe-a place outside\\nspace-time. Once inside its tunnels you could find\\nyourself at any place, at any time. If you enter\\nagain you might be sent to a place frorn which you\\ncould never escape. Yet that is your only hope of\\nreturning to your own place and time.\", \"actions\": [\"{\\\"text\\\": \\\"go back into the cave\\\", \\\"to\\\": 90}\", \"{\\\"text\\\": \\\"remain outside\\\", \\\"to\\\": 91}\"]}", "90": "{\"passage\": \"Inside the cave again, you feel depressed and\\nconfused. Your eyes do not seem to be getting\\nused to the dim light. You cannot find any pas-\\nsageways leading to other times. You feel increas-\\ning-ly drowsy. Soon you fall asleep on the cold clay\\nfloor of the cave.\\nSometime later you awaken. The cave is pitch\\ndark, but the bright light at the opening tells you\\nthe sun is shining brightly outside. You walk out\\ninto the daylight and, to your suprise and delight,\\nyou see Snake Canyon, the trail, the grove of pine\\ntrees nearby, everything just as it was when you \\nentered the cave. Even the sun is in the same \\nplace, just about to pass behind the rim of the\\ncanyon. Somehow you have returned to your own\\ntime--or more precisely, the time it was before\\nyou fell asleep in the cave.\\nYou rub your eyes and start down the path back\\nto the Red Creek Ranch with a story to tell that no\\none will believe, but that you will never forget'\\n\", \"actions\": []}", "91": "{\"passage\": \"Reasoning that you can always find your way\\nback into the cave when you want to, you decide\\nto explore the world in which you have found\\nyourself.\\nYou make your way along a rock ledge over-\\nlooking the plains and lakes, taking care to keep\\nyour bearings so you can find your way back to the\\ncave.\\nBy now you are getting very hungry. You know\\nthat you are in the age of reptiles-at least 100\\nmillion years ago--and that mammals may not yet\\nhave appeared on earth. There will be no rabbits\\nor deer to hunt, though the lakes may contain fish.\\nYou wonder how dinosaur eggs taste.\\nYou follow a wide path through the fern trees.\\nWhen you round the first bend, you find yourself\\nface to face with the honible Triceratops, a great\\ngray monster almost hidden behind its shields and\\nhorns. It looks at you curiously with dull brown\\neyes. You turn, run, and crash into a tree trunk--\\none that wasn't there before!\\nThe bark feels like leather. You look up to see\\nhow high it is-into the jaws of Tyrannosaurus\\nRex.\", \"actions\": []}", "92": "{\"passage\": \"You continue a long distance until you come to\\nthe next tunnel. From there it is oniy a short dis-\\ntance until you reach the surface. An amazing sight\\nmeets your eyes.\\nAs far as you can see, the land looks like a\\nbeautiful park, with soft, feathery grass and tower-\\ning trees. Here and there are clusters of multi-\\ncolored, dome-shaped buildings, connected by\\nramps, terraces and walkways. Some people\\ndressed in simple khaki pants and shirts and tan\\nsneakers walk up to you. They do not understand\\nyour language, nor you theirs. They look much\\nlike the people of your time except that they are\\nunusually trim, muscular, and healthy looking,\\nand they are a good deal smaler than your own\\npeople.\\nThey take you inside a dome-shaped building\\nand show you electronic equipment that looks like\\na computer. You notice a typewriter, so you sit at it\\nand type a message.\\nThe computer prints out a reply. It apparently\\nhas access to memory banks containing your lan-\\nguage. You soon discover you are living in the year\\n3742.\\nYou dive down into the tunnel, hoping you can\\nmake it back to an earlier time. Gratefully, you feel\\ncool, damp air coming up from the cave. You are\\ncurious to try the next tunnel you come to, thinking\\nthat it may show the state of the world just before it\\nbegan to burn up from the intensifying heat of the\\ndying sun, or that it might show what happened\\nafterw,ard! But you suspect that a tunnel further on\\nmight be more likely to lead you back to your own\\ntime.\\n\", \"actions\": [\"{\\\"text\\\": \\\"\\\", \\\"to\\\": 56}\"]}", "94": "{\"passage\": \"You climb up the steps between the last car and\\nthe caboose just as the train begins to start up\\nagain. When you open the doorto the car, you are\\nsurprised to see soldiers in blue uniforms holding\\nold-fashioned rifles. They advance upon you. One\\nof them strides past you to see if anyone else\\nfollowed you.\\n\\\"How did you know this was the President's\\ncar?\\\" the first soldier asks you.\\n\\\"What President?\\\" you reply.\\nThen, to your amazement, you get the answer\\nto your question, for the very tall bearded man\\nwalking down the aisle could be no one else but\\nAbraham Lincoln.\\n\\\"That's all right,\\\" the Presidenttells the soldiers,\\n\\\"l could use some company right now. You may\\nstay until we reach Gettysburg,\\\" he says to you.\\n\\\"But maybe you should get off at Parkersville. I\\nknow of some good people there who will help\\nyou out.\\\"\\n\", \"actions\": [\"{\\\"text\\\": \\\"stay on until Gettysburg\\\", \\\"to\\\": 96}\", \"{\\\"text\\\": \\\"get off at Parkersville\\\", \\\"to\\\": 100}\"]}", "96": "{\"passage\": \"\\\"l'd like to stay on till Gettysburg,\\\" you say.\\n\\\"Well, that's fine,\\\" the President replies. \\\"Why\\ndon't you sit across from me? I have to write out a\\nlittle talk I'm giving there, and, while I'm doing\\nthat, you think about what you're going to make of\\nyour life, because you can't spend all your time\\nriding on hains, after all.\\\"\\nYou nod in agreement and sit quietly watching\\nthe President scribbiing some lines on an en-\\nvelope. After awhile he looks up from his writing\\nand you look each other in the eyes.\\n\\\"You have a great future,\\\" he says abrupfly.\\n\\\"How can you tell,\\\" you ask.\\n\\\"By looking at your face.\\\"\\n\\\"Just by that?\\\"\\n\\\"Just so.\\\"\\nfu you are talking, you notice two elaborately\\ndressed men approaching from the end of the car.\\nThey whisper a few words to the President. He\\nexcuses himself, shakes hands with you, and tells\\none of his soldiers to see that you are provided for\\nin Gettysburg.\\nWhen you arrive at Gettysburg, one of the sol-\\ndiers takes you to a family who welcomes you\\nwarmly and agrees to put you up for a while, if you\\nwill help them out with their farm.\\nYou find it amazing to be iiving in a time with no\\ncars, radios, television, record players, or even\\ntelephones. It's peaceful---at least when there is\\nnot a war going on-but you feel homesick\\\" You\\nfeel the great future the President predicted for you\\nlies in your own time, and you resolve to find your\\nway back to the Cave of Time.\\n\", \"actions\": []}", "98": "{\"passage\": \"If you take the train, it may ruin your chance to\\nretuin to the Cave of Time. It seems best to stay\\nclose to the tunnel. At any rate, you decide you will\\nbe able to think better after getting something to\\neat, so you walk over to the farmhouse.\\nThe farmer's wife gives you a bowl of soup, but\\nshe won't b elievethe story you make up to explain\\nyour presence there. You soon get the idea you\\nare not welcome, so you tudge on into town,\\nwhere the innkeeper lets you have a room for the\\nnight.\\nThe next moming you get a ride on a coach to\\nPhiladelphia. A Quaker family takes you in and\\nhelps you get work as a carpenter's apprentice'\\nYou don't like the job, and soon you leave\\nPhiladelphia to go to New York, where you are\\nable to find a job working for a newspaper. Even-\\ntually you travel all over the world. You live a long\\nand wonderful life, dying just a few years before\\nyou are born.\", \"actions\": []}"}